CFDEMcoupling-PUBLIC-v2506/tutorials/cfdemSolverPiso/ErgunTestMPI_restart/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          192;
        startFace       13248;
    }
    outlet
    {
        type            patch;
        nFaces          192;
        startFace       13440;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          768;
        startFace       13632;
    }
)

// ************************************************************************* //
